#+title: Pytorch and Tensorflow Setup
#+author: John Nehls

** recent =nvidia-smi= output
#+begin_src shell :results output verbatim
nvidia-smi
#+end_src

#+RESULTS:
#+begin_example
Thu May 25 13:13:16 2023
+---------------------------------------------------------------------------------------+
| NVIDIA-SMI 530.41.03              Driver Version: 530.41.03    CUDA Version: 12.1     |
|-----------------------------------------+----------------------+----------------------+
| GPU  Name                  Persistence-M| Bus-Id        Disp.A | Volatile Uncorr. ECC |
| Fan  Temp  Perf            Pwr:Usage/Cap|         Memory-Usage | GPU-Util  Compute M. |
|                                         |                      |               MIG M. |
|=========================================+======================+======================|
|   0  NVIDIA GeForce GTX 1050 Ti      Off| 00000000:01:00.0 Off |                  N/A |
| 51%   67C    P0               N/A /  72W|   2069MiB /  4096MiB |    100%      Default |
|                                         |                      |                  N/A |
+-----------------------------------------+----------------------+----------------------+

+---------------------------------------------------------------------------------------+
| Processes:                                                                            |
|  GPU   GI   CI        PID   Type   Process name                            GPU Memory |
|        ID   ID                                                             Usage      |
|=======================================================================================|
|    0   N/A  N/A      2416      G   /usr/bin/gnome-shell                          1MiB |
|    0   N/A  N/A      6993      C   /usr/bin/python3                           2064MiB |
+---------------------------------------------------------------------------------------+
#+end_example


